Revit 2018 API
ConicalSurface Members
The ConicalSurface type exposes the following members.
Methods
Name | Description
Create
 Creates a conical surface defined by a local reference frame and a half angle.
Dispose |  (Inherited from Surface.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFrameOfReference
 Returns frame of reference associated with this ConicalSurface.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidConeAngle
 Checks whether the input value lies is not 0, greater than -PI/2 and lesser than PI/2.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Axis
 Axis of the cone. This is the Z axis of the local coordinate system associated with this cone.
HalfAngle
 Cone angle.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Surface.)
OrientationMatchesParametricOrientation
 Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation.
 (Inherited from Surface.)
Origin
 Apex of the cone. This is the origin of the local coordinate system associated with this cone.
XDir
 X axis of the local coordinate system associated with this cone.
YDir
 X axis of the local coordinate system associated with this cone.
See Also
ConicalSurface Class
Autodesk.Revit.DB Namespace